app/controllers/credits_controller.rb

  def index
  	@loanList = Loan.all
---
SELECT "loans".* FROM "loans" WHERE (name LIKE '%%') ORDER BY "loans"."created_at" DESC