app/controllers/loans_controller.rb

INSERT INTO "loans" ("name", "amoung", "date", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Karolcia"], ["amoung", 1200.0], ["date", Sat, 25 Mar 2017], ["description", "Na prawo jazdy"], ["created_at", 2017-03-26 13:21:10 UTC], ["updated_at", 2017-03-26 13:21:10 UTC]]
---
	def create
		Loan.create(loan_params)

SELECT  "loans".* FROM "loans" WHERE "loans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@loan = Loan.find(params[:id])

SELECT  "loans".* FROM "loans" WHERE "loans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "loans" SET "description" = ?, "updated_at" = ? WHERE "loans"."id" = ?  [["description", "Na komputer2"], ["updated_at", 2017-03-26 14:26:05 UTC], ["id", 1]]
---
	def update
		@loan = Loan.find(params[:id])
		if @loan.update_attributes(loan_params)

SELECT  "loans".* FROM "loans" WHERE "loans"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "loans" WHERE "loans"."id" = ?  [["id", 2]]
---
	def destroy
		@loan = Loan.find(params[:id])
		@loan.destroy